ChenDudo/DAPLink/mm32usb_null.c
    /* Make the endpoint max packet size align with USB Specification 2.0. */
    if (USB_ENDPOINT_ISOCHRONOUS == type) {
        if (maxPacketSize > 1023U) maxPacketSize = 1023U;
    }
    else {
		if (maxPacketSize > 64U) maxPacketSize = 64U;
        /* Enable an endpoint to perform handshaking during a transaction to this endpoint. */
        khciState.registerBase->EP_CTL[endpoint] |= USB_ENDPT_EPHSHK_MASK;
    }
    /* Set the endpoint idle */
    khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
    /* Save the max packet size of the endpoint */
    khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize = maxPacketSize;
    /* Set the data toggle to DATA0 */
    khciState.endpointState[index].stateUnion.stateBitField.data0 = 0U;
    /* Clear the endpoint stalled state */
    khciState.endpointState[index].stateUnion.stateBitField.stalled = 0U;
    /* Set the ZLT field */
    khciState.endpointState[index].stateUnion.stateBitField.zlt = 1U;
    /* Enable the endpoint. */
    khciState.registerBase->EP_CTL[endpoint] |= (USB_IN == direction) ? USB_ENDPT_EPTXEN_MASK : USB_ENDPT_EPRXEN_MASK;

    /* Prime a transfer to receive next setup packet when the endpoint is control out endpoint. */
    if ((USB_CONTROL_ENDPOINT == endpoint) && (USB_OUT == direction)) {
        USB_DeviceKhciPrimeNextSetup();
    }
}

void USB_DeviceKhciRecv(uint8_t endpointAddress, uint8_t* buffer, uint32_t length)
{
    uint32_t index = ((endpointAddress & USB_ENDPOINT_NUMBER_MASK) << 1U) | USB_OUT;

    if ((0U == length) && (USB_CONTROL_ENDPOINT == (endpointAddress & USB_ENDPOINT_NUMBER_MASK))) {
        khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
        USB_DeviceKhciPrimeNextSetup();
    }
    else {
        /* Save the tansfer information */
        if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
            khciState.endpointState[index].transferDone = 0U;
            khciState.endpointState[index].transferBuffer = buffer;
            khciState.endpointState[index].transferLength = length;
        }
        khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 1U;

        /* Data length needs to less than max packet size in each call. */
        if (length > khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) {
            length = khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize;
        }

        buffer = (uint8_t*)((uint32_t)buffer + (uint32_t)khciState.endpointState[index].transferDone);

        if ((khciState.dmaAlignBuffer) && (0U == khciState.isDmaAlignBufferInusing) &&
                (USB_DEVICE_CONFIG_KHCI_DMA_ALIGN_BUFFER_LENGTH >= length) &&
                ((length & 0x03U) || (((uint32_t)buffer) & 0x03U))) {
            khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 0U;
            buffer = khciState.dmaAlignBuffer;
            khciState.isDmaAlignBufferInusing = 1U;
        }

        /* Receive data when the device is not resetting. */
        if (0U == khciState.isResetting) {
            USB_DeviceKhciEndpointTransfer(endpointAddress & USB_ENDPOINT_NUMBER_MASK, USB_OUT, buffer, length);
        }
    }
}

void USB_DeviceKhciSend(uint8_t endpointAddress, uint8_t* buffer, uint32_t length)
{
    uint32_t index = ((endpointAddress & USB_ENDPOINT_NUMBER_MASK) << 1U) | USB_IN;

    /* Save the tansfer information */
    if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        khciState.endpointState[index].transferDone = 0U;
        khciState.endpointState[index].transferBuffer = buffer;
        khciState.endpointState[index].transferLength = length;
        khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 1U;
    }

    /* Data length needs to less than max packet size in each call. */
    if (length > khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) {
        length = khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize;
    }

    /* Send data when the device is not resetting. */
    if (0U == khciState.isResetting) {
        USB_DeviceKhciEndpointTransfer(endpointAddress & USB_ENDPOINT_NUMBER_MASK, USB_IN,\
		(uint8_t*)((uint32_t)khciState.endpointState[index].transferBuffer + (uint32_t)khciState.endpointState[index].transferDone), length);
    }

    /* Prime a transfer to receive next setup packet if the dat length is zero in a control in endpoint. */
    if ((0U == khciState.endpointState[index].transferDone) && (0U == length) && (USB_CONTROL_ENDPOINT == (endpointAddress & USB_ENDPOINT_NUMBER_MASK))) {
        USB_DeviceKhciPrimeNextSetup();
    }
}

static void USB_DeviceKhciInterruptReset(void)
{
    /* Set KHCI reset flag */
    khciState.isResetting = 1U;

    /* Clear the reset interrupt */
    khciState.registerBase->INT_STAT = (kUSB_KhciInterruptReset);
}

void USB_DeviceKhciInterruptTokenDone(void)
{
    uint32_t control, length, remainingLength;
    uint8_t* bdtBuffer;
    uint8_t endpoint, direction, bdtOdd, isSetup;
    uint8_t index;
    uint8_t stateRegister = khciState.registerBase->STAT;

    /* Get the endpoint number to identify which one triggers the token done interrupt. */
    endpoint 	= (stateRegister & USB_STAT_ENDP_MASK) 	>> USB_STAT_ENDP_SHIFT;
    direction	= (stateRegister & USB_STAT_TX_MASK)	>> USB_STAT_TX_SHIFT;
    bdtOdd		= (stateRegister & USB_STAT_ODD_MASK) 	>> USB_STAT_ODD_SHIFT;
    /* Clear token done interrupt flag. */
    khciState.registerBase->INT_STAT = kUSB_KhciInterruptTokenDone;
    /* Get the Control field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    control = USB_KHCI_BDT_GET_CONTROL((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);
    /* Get the buffer field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    bdtBuffer = (uint8_t*)USB_KHCI_BDT_GET_ADDRESS((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);
    /* Get the transferred length. */
    length = ((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 16U) & 0x3FFU;
    isSetup = (USB_KHCI_BDT_DEVICE_SETUP_TOKEN == ((uint8_t)(((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 2U) & 0x0FU))) ?
              1U :
              0U;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        return;
    }

    if (isSetup) {
        khciState.setupBufferIndex = bdtOdd;
    }

