ChenDudo/DAPLink/mm32usb_null.c
    /* USB_IN, Send completed */
    if (direction == USB_IN) {
        /* The transferred length */
        khciState.endpointState[index].transferDone += length;
        /* Remaining length */
        remainingLength = khciState.endpointState[index].transferLength - khciState.endpointState[index].transferDone;
        /* Change the data toggle flag */
        khciState.endpointState[index].stateUnion.stateBitField.data0 ^= 1U;
        /* Change the BDT odd toggle flag */
        khciState.endpointState[index].stateUnion.stateBitField.bdtOdd ^= 1U;
        /* Whether the transfer is completed or not. */
        /* The transfer is completed when one of the following conditions meet:
         * 1. The remaining length is zero.
         * 2. The length of current transcation is less than the max packet size of the current pipe.*/
        if ((0U == remainingLength) || (khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize > length)) {
            khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;

            /* Whether need to send ZLT when the pipe is control in pipe and the transferred length of current
             * transaction equals to max packet size.            */
            if ((length) && (!(length % khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize))) {
                if (USB_CONTROL_ENDPOINT == endpoint) {
                    usb_setup_struct_t* setup_packet = (usb_setup_struct_t*)(&khciState.setupPacketBuffer[(USB_SETUP_PACKET_SIZE * khciState.setupBufferIndex)]);
                    /* Send the ZLT and terminate the token done interrupt service when the tranferred length in data phase is less than the host request. */
                    if (USB_SHORT_FROM_LITTLE_ENDIAN(setup_packet->wLength) > khciState.endpointState[index].transferLength) {
                        (void)USB_DeviceKhciEndpointTransfer(endpoint, USB_IN, (uint8_t*)NULL, 0U); return;
                    }
                }
                else if (khciState.endpointState[index].stateUnion.stateBitField.zlt) {
                    (void)USB_DeviceKhciEndpointTransfer(endpoint, USB_IN, (uint8_t*)NULL, 0U); return;
                }
            }
        }
        else {
            /* Send remaining data and terminate the token done interrupt service. */
            (void)USB_DeviceKhciSend(endpoint | (USB_IN << 0x07U), khciState.endpointState[index].transferBuffer, remainingLength);
            return;
        }
    }
    else {
        if (!((USB_CONTROL_ENDPOINT == endpoint) && (0U == length))) {
            if (0U == khciState.endpointState[index].stateUnion.stateBitField.dmaAlign) {
                uint8_t* buffer = (uint8_t*)USB_LONG_FROM_LITTLE_ENDIAN(USB_KHCI_BDT_GET_ADDRESS((uint32_t)khciState.bdt, endpoint, USB_OUT, khciState.endpointState[index].stateUnion.stateBitField.bdtOdd));
                uint8_t* transferBuffer =  khciState.endpointState[index].transferBuffer + khciState.endpointState[index].transferDone;
                if (buffer != transferBuffer) {
                    for (uint32_t i = 0U; i < length; i++) {
                        transferBuffer[i] = buffer[i];
                    }
                }
                khciState.isDmaAlignBufferInusing = 0U;
            }
            /* The transferred length */
            khciState.endpointState[index].transferDone += length;
            /* Remaining length */
            remainingLength = khciState.endpointState[index].transferLength - khciState.endpointState[index].transferDone;

            if ((USB_CONTROL_ENDPOINT == endpoint) && isSetup) {
                khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].stateUnion.stateBitField.data0 = 1U;
                khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_IN ].stateUnion.stateBitField.data0 = 1U;
            }
            else {
                khciState.endpointState[index].stateUnion.stateBitField.data0 ^= 1U;
            }
            khciState.endpointState[index].stateUnion.stateBitField.bdtOdd ^= 1U;
            if ((!khciState.endpointState[index].transferLength) || (!remainingLength) || (khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize > length)) {
                khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
            }
            else {
                /* Receive remaining data and terminate the token done interrupt service. */
                USB_DeviceKhciRecv((endpoint) | (USB_OUT << 0x07U), khciState.endpointState[index].transferBuffer, remainingLength);
                return;
            }
        }
    }

    khciState.registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}


/*
 *  USB Device Interrupt enable
 *   Called by USBD_Init to enable the USB Interrupt
 *    Return Value:    None
 */
#ifdef __RTX
void __svc(1) USBD_IntrEna(void);
void __SVC_1(void) {
#else
void          USBD_IntrEna(void) {
#endif
    NVIC_EnableIRQ(USB_FS_IRQn);
}

/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB Device
 *    Return Value:    None
 */
void USBD_Init(void)
{
	USB_Clock_Config();
    
	USB_DeviceKhciDeinit();
	USB_DeviceKhciInit();
	
	USBD_IntrEna();
    //USBD_Reset();
}

/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */
void USBD_Connect(BOOL con)
{
    // not support
    // (con) ? (USB_OTG_FS->CTL |= OTG_FS_CTL_USB_EN_SOF_EN) : \
	// 	(USB_OTG_FS->CTL &= ~OTG_FS_CTL_USB_EN_SOF_EN);
}

/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */
void USBD_Reset(void)
{
	USB_ENDPOINT_DESCRIPTOR *pEPD;
	
    NVIC_DisableIRQ(USB_FS_IRQn);
	
	USB_DeviceKhciInterruptReset();
	
	pEPD->bmAttributes = USB_ENDPOINT_TYPE_CONTROL;
	pEPD->wMaxPacketSize = USB_CONTROL_MAX_PACKET_SIZE;
	pEPD->bEndpointAddress = USB_CONTROL_ENDPOINT | (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
	
    /* Initialize the control IN pipe */
	USB_DeviceKhciEndpointInit((USB_ENDPOINT_DESCRIPTOR *)pEPD);
	
	/* Initialize the control OUT pipe */
	pEPD->bEndpointAddress = USB_CONTROL_ENDPOINT | (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
	USB_DeviceKhciEndpointInit((USB_ENDPOINT_DESCRIPTOR *)pEPD);
	
    NVIC_EnableIRQ(USB_FS_IRQn);
}


