ChenDudo/DAPLink/mm32usb_null.c
}

/*
 *  Clear USB Device Endpoint Buffer
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_ClearEPBuf(U32 EPNum)
{
    uint32_t  cnt, i;
    uint8_t  *dataptr;
    uint8_t endpoint, direction;
    uint32_t index;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;
    dataptr = khciState.endpointState[index].transferBuffer;
    cnt = khciState.endpointState[index].transferLength;
    for (i = 0; i < cnt; i++) {
        dataptr[i] = 0;
    }
}

/*
 *  Read USB Device Endpoint Data
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *                      pData: Pointer to Data Buffer
 *  Return Value:   Number of bytes read
 */
U32 USBD_ReadEP(U32 EPNum, U8 *pData, U32 cnt)
{// OUT buffer
	uint8_t endpoint, direction;
    uint32_t index;
	uint8_t* buffer;
	
    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    if(USB_IN==direction){
        return 0;
    }

	//memcpy(pData, buffer, cnt); //TODO

    return 0;
}

/*
 *  Write USB Device Endpoint Data
 *  Parameters:   EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *                   pData: Pointer to Data Buffer
 *                   cnt:   Number of bytes to write
 *  Return Value:   Number of bytes written
 */
U32 USBD_WriteEP(U32 EPNum, U8 *pData, U32 cnt)
{// IN buffer
    uint8_t endpoint, direction;
    uint32_t index;
    uint32_t* buffer;

    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    /* only IN EP */
    if (USB_OUT == direction) {
		return 0;
    }
	
	buffer= (uint32_t*)khciState.endpointState[index].transferBuffer + (uint32_t)khciState.endpointState[index].transferDone;
	
    
    return 0;
}

/*
 *  Get USB Device Last Frame Number
 *  Parameters:     None
 *  Return Value:   Frame Number
 */
U32 USBD_GetFrame(void)
{
    return 0;
}

/*
 *  Get USB Last Error Code
 *  Parameters:   None
 *  Return Value:   Error Code
 */
U32 USBD_GetError(void)
{
    return 0;
}


void tokenhandle()
{
//USB_DeviceKhciInterruptTokenDone();
	uint32_t control;
    uint32_t length;
    uint32_t remainingLength;
    uint8_t* bdtBuffer;
	uint8_t endpoint;
    uint8_t direction;
    uint8_t bdtOdd;
    uint8_t isSetup;
    uint8_t index;
    uint8_t stateRegister = khciState.registerBase->STAT;
        
	/* Get the endpoint number to identify which one triggers the token done interrupt. */
    endpoint = (stateRegister & USB_STAT_ENDP_MASK) >> USB_STAT_ENDP_SHIFT;

    /* Get the direction of the endpoint number. */
    direction = (stateRegister & USB_STAT_TX_MASK) >> USB_STAT_TX_SHIFT;

    /* Get the finished BDT ODD. */
    bdtOdd = (stateRegister & USB_STAT_ODD_MASK) >> USB_STAT_ODD_SHIFT;

    /* Clear token done interrupt flag. */
    khciState.registerBase->INT_STAT = kUSB_KhciInterruptTokenDone;

    /* Get the Control field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    control = USB_KHCI_BDT_GET_CONTROL((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);

    /* Get the buffer field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    bdtBuffer = (uint8_t*)USB_KHCI_BDT_GET_ADDRESS((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);

    /* Get the transferred length. */
    length = ((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 16U) & 0x3FFU;

    /* Get the transferred length. */
    isSetup = (USB_KHCI_BDT_DEVICE_SETUP_TOKEN == ((uint8_t)(((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 2U) & 0x0FU))) ? 1U : 0U;

	if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        return;
    }

    if (isSetup) {
        khciState.setupBufferIndex = bdtOdd;
    }

	/* USB_IN, Send completed */
    if (USB_IN == direction) {
#ifdef __RTX
            if (USBD_RTX_EPTask[num])   isr_evt_set(USBD_EVT_IN,  USBD_RTX_EPTask[num]);
#else
            if (USBD_P_EP[endpoint])         USBD_P_EP[endpoint](USBD_EVT_IN);
#endif
        }
        if (USB_OUT == direction) {
            if (USB_CONTROL_ENDPOINT == endpoint){
#ifdef __RTX
                if (USBD_RTX_EPTask[num / 2])   isr_evt_set(USBD_EVT_OUT, USBD_RTX_EPTask[num / 2]);
#else
                if (USBD_P_EP[endpoint / 2])         USBD_P_EP[endpoint](USBD_EVT_SETUP);
#endif
			}
            else {
#ifdef __RTX
				if (USBD_RTX_EPTask[num])   isr_evt_set(USBD_EVT_OUT,  USBD_RTX_EPTask[num]);
#else
				if (USBD_P_EP[endpoint])         USBD_P_EP[endpoint](USBD_EVT_OUT);
#endif
			}
		}
}

		
void USBD_Handler(void)
{
    uint32_t status = USB_OTG_FS->INT_STAT;
    //USB_OTG_FS->INT_STAT = status;

    /* Error interrupt */
    if (status & kUSB_KhciInterruptError) {
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptError;
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_ERROR, USBD_RTX_DevTask);
#else
        if (USBD_P_Error_Event)     USBD_P_Error_Event(1);
#endif
    }
    
    /* Suspend interrupt */
    if (status & kUSB_KhciInterruptSleep) {
        USBD_Suspend();
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptSleep;
        //USB_DeviceKhciInterruptSleep(khciState.);
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_SUSPEND, USBD_RTX_DevTask);
#else
        if (USBD_P_Suspend_Event)   USBD_P_Suspend_Event();
#endif
    }

    /* Start of Frame interrupt */
    if (status & kUSB_KhciInterruptSofToken) {
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptSofToken;
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_SOF, USBD_RTX_DevTask);
#else
        if (USBD_P_SOF_Event)       USBD_P_SOF_Event();
#endif
    }

    /* Reset interrupt */
    if (status & kUSB_KhciInterruptReset) {
        USB_OTG_FS->INT_STAT = kUSB_KhciInterruptReset;
        USBD_Reset();
        usbd_reset_core();
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_RESET, USBD_RTX_DevTask);
#else
        if (USBD_P_Reset_Event)     USBD_P_Reset_Event();
#endif
    }

    /* Token done interrupt */
    if (status & kUSB_KhciInterruptTokenDone) {
        tokenhandle();
	}

    NVIC_EnableIRQ(USB_FS_IRQn);
}

void OTG_FS_IRQHandler(void)
{
    NVIC_DisableIRQ(USB_FS_IRQn);
    USBD_SignalHandler();
}
